OpenFOAM case folders/Experimental validation/Static drift/KVLCC2/Fr0.1424_alpha0.00/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
	version    2.0;
	format     ascii;
	class      dictionary;
	object     snappyHexMeshDict;
}


	castellatedMesh    true;
	snap               true;
	addLayers          true;

geometry
{
	kelvinWake1.obj
	{
		type triSurfaceMesh;
		name kelvinWake1;
	}

	kelvinWake2.obj
	{
		type triSurfaceMesh;
		name kelvinWake2;
	}

	kelvinWake3.obj
	{
		type triSurfaceMesh;
		name kelvinWake3;
	}

	ship
	{
		type triSurfaceMesh;
		file "ship.obj";

		regions
		{
			ship_ship_hull
			{
				name hull;
			}
			ship_ship_deck
			{
				name deck;
			}
		}
	}

	viscBox4
	{
		type searchableBox;
		min (2.112250 -0.564816 -0.437459);
		max (3.354750 0.564816 0.124250);
	}

	viscBox3
	{
		type searchableBox;
		min (2.112250 -0.739263 -0.611907);
		max (3.976000 0.739263 0.124250);
	}

	viscBox2
	{
		type searchableBox;
		min (2.112250 -1.053268 -0.925912);
		max (4.907875 1.053268 0.124250);
	}

	viscBox1
	{
		type searchableBox;
		min (2.112250 -1.576610 -1.449254);
		max (6.305687 1.576610 0.124250);
	}

	freeSurfaceBoxIsotropic1
	{
		type searchableBox;
		min (-999.000000 -999.000000 -0.454631);
		max (999.000000 999.000000 0.454631);
	}

	freeSurfaceBox1
	{
		type searchableBox;
		min (-999.000000 -999.000000 -0.062125);
		max (999.000000 999.000000 0.062125);
	}

	freeSurfaceBox2
	{
		type searchableBox;
		min (-999.000000 -999.000000 -0.062125);
		max (999.000000 999.000000 0.062125);
	}

	freeSurfaceBox3
	{
		type searchableBox;
		min (-999.000000 -999.000000 -0.062125);
		max (999.000000 999.000000 0.062125);
	}

	freeSurfaceBox4
	{
		type searchableBox;
		min (-999.000000 -999.000000 -0.062125);
		max (999.000000 999.000000 0.062125);
	}

	freeSurfaceBox5
	{
		type searchableBox;
		min (-999.000000 -999.000000 -0.062125);
		max (999.000000 999.000000 0.062125);
	}

}

castellatedMeshControls
{
	maxLocalCells 5000000;
	maxGlobalCells 2000000000;
	minRefinementCells 10;
	maxLoadUnbalance 0.1;
	nCellsBetweenLevels 5;
	resolveFeatureAngle 60;
	locationInMesh (-4.970 1.351 -0.646);
	allowFreeStandingZoneFaces true;

	features
	(
		{
			file "ship.eMesh";
			level 4;
		}
	);

	refinementSurfaces
	{
		ship
		{
			level (4 4);
			regions
			{
				ship_ship_hull
				{
					level (6 6);
					patchIno
					{
						type wall;
					}
				}
				ship_ship_deck
				{
					level (4 4);
					patchIno
					{
						type wall;
					}
				}
			}
		}

	}

	refinementRegions
	{
		kelvinWake1
		{
			mode inside;
			levels ((1.0 1));
		}

		kelvinWake2
		{
			mode inside;
			levels ((1.0 2));
		}

		kelvinWake3
		{
			mode inside;
			levels ((1.0 3));
		}

		viscBox4
		{
			mode inside;
			levels ((0.564816 4));
		}

		viscBox3
		{
			mode inside;
			levels ((0.739263 3));
		}

		viscBox2
		{
			mode inside;
			levels ((1.053268 2));
		}

		viscBox1
		{
			mode inside;
			levels ((1.576610 1));
		}

		ship
		{
			mode distance;
			levels ((0.248500 4));
		}

		freeSurfaceBoxIsotropic1
		{
			mode inside;
			levels ((1.000000 1));
		}

		freeSurfaceBox1
		{
			mode inside;
			levels ((1.000000 1));
			levelIncrement (5 5 (0 0 1));
		}

		freeSurfaceBox2
		{
			mode inside;
			levels ((1.000000 1));
			levelIncrement (4 4 (0 0 2));
		}

		freeSurfaceBox3
		{
			mode inside;
			levels ((1.000000 1));
			levelIncrement (3 3 (0 0 3));
		}

		freeSurfaceBox4
		{
			mode inside;
			levels ((1.000000 1));
			levelIncrement (2 2 (0 0 4));
		}

		freeSurfaceBox5
		{
			mode inside;
			levels ((1.000000 1));
			levelIncrement (1 1 (0 0 5));
		}

	}
}

snapControls
{
	nSmoothPatch              3;
	tolerance                 2.0;
	nSolveIter                100;
	nRelaxIter                5;
	nFeatureSnapIter          10;
	implicitFeatureSnap       false;
	explicitFeatureSnap       true;
	multiRegionFeatureSnap    false;
}

addLayersControls
{
	meshShrinker displacementMotionSolver;
	solver       displacementLaplacian;
	displacementLaplacianCoeffs
	{
		diffusivity    quadratic inverseDistance 1(wall);
	}

	layers
	{
		hull
		{
			nSurfaceLayers 3;
		}
		deck
		{
			nSurfaceLayers 0;
		}
	}

	relativeSizes false;
	finalLayerThickness 0.0036797469168147767;
	expansionRatio 1.15;
	minThickness 0.0013912086642021843;
	nGrow 0;
	featureAngle 60;
	slipFeatureAngle 30;
	layerTerminationAngle 30;
	nRelaxIter 5;
	nSmoothSurfaceNormals 3;
	nSmoothNormals 3;
	nSmoothThickness 10;
	maxFaceThicknessRatio 0.5;
	maxThicknessToMedialRatio 0.3;
	minMedianAxisAngle 90;
	nBufferCellsNoExtrude 0;
	nLayerIter 50;
	nRelaxedIter 20;
}

meshQualityControls
{
	maxNonOrtho            65;
	maxBoundarySkewness    20;
	maxInternalSkewness    4;
	maxConcave             80;
	minVol                 -1e+30;
	minTetQuality          -1e+30;
	minArea                -1;
	minTwist               0.05;
	minDeterminant         0.001;
	minFaceWeight          0.05;
	minVolRatio            0.01;
	minTriangleTwist       -1;
	nSmoothScale           4;
	errorReduction         0.75;
	relaxed
	{
		maxNonOrtho    75;
	}
}

mergeTolerance 1e-06;
